# Severity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureDefinition..::..Severity Property
FailureDefinition Class See Also
---
The severity of the failure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FailureSeverity Severity { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Severity As FailureSeverity
	Get
```

Visual C++
---
```text
public:
property FailureSeverity Severity {
	FailureSeverity get ();
}
```

# See Also
FailureDefinition Class
Autodesk.Revit.DB Namespace